fix: 아키텍처 머메이드로 수정
